In [1]:
import mysql.connector
import pandas as pd
from dotenv import load_dotenv
import os
from sql_helpers import run_sql_query, create_lesson_8_db
load_dotenv()  # loads variables from .env file
mysql_password = os.getenv("MYSQL_PASSWORD")
connection = mysql.connector.connect(
    host="localhost",
    user="root",
    password=mysql_password,
)
cursor = connection.cursor()

In [2]:
create_lesson_8_db(cursor, connection)

In [3]:
# Aggregation - COUNT
query = """SELECT customer_id, COUNT(*) AS total_orders FROM OnlineOrder GROUP BY customer_id HAVING total_orders > 2;"""
run_sql_query(query, cursor)

   customer_id  total_orders
0            6             3
1            7             3
2            8             3

In [4]:
# Aggregation - AVERAGE
query = """SELECT category, AVG(price) AS avg_price FROM Product GROUP BY category HAVING avg_price > 3;"""
run_sql_query(query, cursor)

   category avg_price
0  Starters  3.995000
1     Mains  9.430000
2    Drinks  4.800000